In [1]:
list1 = [1,2,3,4,5]
list1

[1, 2, 3, 4, 5]

In [2]:
list1[2]

3

In [5]:
import pandas as pd

series1 = pd.Series(list1, index= ['a', 'b', 'c', 'd', 'e'])

In [7]:
series1['e']

5

In [10]:
rollnos =[10,20,30,40]

rollnos_series = pd.Series(rollnos, index =['rahul', 'arun', 'kumar', 'sagar'])

In [11]:
rollnos_series['sagar']

40

In [12]:
some_dict = {'a':1, 'b':2, 'c':3}

In [14]:
some_dict

{'a': 1, 'b': 2, 'c': 3}

In [15]:
pd.Series(some_dict)

a    1
b    2
c    3
dtype: int64

In [18]:
rollnos_series.max()

40

In [ ]:
def factorial(num1):

In [19]:
def print_welcome():
    print("i have been called, welcome to teh function definiition ")

In [20]:
print_welcome()

i have been called, welcome to teh function definiition

In [22]:
list_marks_updated =[]
for num in list_marks:
    num_updated = grace_marks(num)
    list_marks_updated.append(num_updated)

In [23]:
list_marks_updated

[60, 71, 60, 38, 27, 82, 93]

In [21]:
def grace_marks(marks):
    return marks+5


list_marks =[55,66,55,33,22,77,88]
series_marks = pd.Series(list_marks)
series_marks.apply(grace_marks)

0    60
1    71
2    60
3    38
4    27
5    82
6    93
dtype: int64

In [24]:
list_marks =[55,66,55,None,22,77,88]

series_marks = pd.Series(list_marks)

series_marks.isna()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [27]:
#series_marks.fillna(0, inplace=True)

series_marks = series_marks.fillna(0)

In [28]:
series_marks

0    55.0
1    66.0
2    55.0
3     0.0
4    22.0
5    77.0
6    88.0
dtype: float64

In [29]:
list_names= ['arun', 'kumar', 'rahul']
list_marks =[55,66,77]
combined_list = list(zip(list_names, list_marks))

In [30]:
combined_list

[('arun', 55), ('kumar', 66), ('rahul', 77)]

In [33]:
students_df = pd.DataFrame(combined_list, columns=['Name', 'Marks'] )

In [35]:
students_df.set_index('Name')

       Marks
Name
arun      55
kumar     66
rahul     77

In [36]:
dict_stds = {'taran':77,'arun':66, 'yasir':55}

In [43]:
dict_stds={'names':['taran', 'arun', 'yasir'], 'marks': [77,66,55]}

In [44]:
dict_stds

{'names': ['taran', 'arun', 'yasir'], 'marks': [77, 66, 55]}

In [46]:
stds_df = pd.DataFrame(dict_stds)

In [52]:
stds_df

   names  marks
0  taran     77
1   arun     66
2  yasir     55

In [48]:
std_list = [{'taran':77}, {'arun':66}, {'yasir':55}]

In [50]:
std_list =[{'names':'taran', 'marks':77},]

In [51]:
pd.DataFrame(std_list)

   names  marks
0  taran     77

In [53]:
stds_df

   names  marks
0  taran     77
1   arun     66
2  yasir     55

In [54]:
stds_df.set_index('names')

       marks
names
taran     77
arun      66
yasir     55

In [56]:
stds_df['marks']

0    77
1    66
2    55
Name: marks, dtype: int64

In [58]:
import numpy as np
arr_2d = np.random.randint(2,9,(4,2))

In [60]:
pd.DataFrame(arr_2d,  columns=['A', 'B'])

   A  B
0  8  3
1  3  8
2  8  2
3  6  7

In [64]:
stds_df[(stds_df['marks']>66) | (stds_df['names']=='taran')]

   names  marks
0  taran     77

In [71]:
stds_df = stds_df.rename(columns={'names':'Names', 'marks': 'Marks'})

In [74]:
stds_df

   Names  Marks
0  taran     77
1   arun     66
2  yasir     55

In [73]:
#stds_df.drop(columns ='Names')
stds_df.drop('Names', axis =1)

   Marks
0     77
1     66
2     55

In [32]:
import pandas as pd

titanic_df = pd.read_csv('titanic.csv', encoding='utf-8')

In [4]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
titanic_df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [10]:
titanic_df[['Name','Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [11]:
titanic_df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [12]:
titanic_df[titanic_df['Sex']=='male'][['Name','Age']]

                               Name   Age
0           Braund, Mr. Owen Harris  22.0
4          Allen, Mr. William Henry  35.0
5                  Moran, Mr. James   NaN
6           McCarthy, Mr. Timothy J  54.0
7    Palsson, Master. Gosta Leonard   2.0
..                              ...   ...
883   Banfield, Mr. Frederick James  28.0
884          Sutehall, Mr. Henry Jr  25.0
886           Montvila, Rev. Juozas  27.0
889           Behr, Mr. Karl Howell  26.0
890             Dooley, Mr. Patrick  32.0

[577 rows x 2 columns]

In [13]:
titanic_df['Survived'].unique()

array([0, 1], dtype=int64)

In [18]:
print("the no. of male passengers survived who are above 20 is",titanic_df[(titanic_df['Sex']=='male') & (titanic_df['Survived']==1) & (titanic_df['Age']>20)].shape[0])

the no. of male passengers survived who are above 20 is 64

In [19]:
titanic_df.shape

(891, 12)

In [22]:
titanic_df[(titanic_df['Sex']=='male') & (titanic_df['Survived']==1) & (titanic_df['Age']>20)][['Name','Age']].to_csv('males_survived.csv')

In [27]:
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
titanic_df.set_index('PassengerId', inplace=True)

In [30]:
titanic_df.iloc[:,:]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [32]:
titanic_df.loc[0:10, ['Name','Age']]

                                                          Name   Age
PassengerId
1                                      Braund, Mr. Owen Harris  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3                                       Heikkinen, Miss. Laina  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
5                                     Allen, Mr. William Henry  35.0
6                                             Moran, Mr. James   NaN
7                                      McCarthy, Mr. Timothy J  54.0
8                               Palsson, Master. Gosta Leonard   2.0
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
10                         Nasser, Mrs. Nicholas (Adele Achem)  14.0

In [34]:
grouped_data = titanic_df.groupby('Sex')

In [41]:
grouped_data.get_group('male').shape

(577, 11)

In [45]:
titanic_df[titanic_df['Sex']=='male'].shape

(577, 11)

In [51]:
titanic_df.groupby(['Survived','Sex'])['Fare'].agg(['sum','mean'])

                        sum       mean
Survived Sex
0        female   1864.9752  23.024385
         male    10277.7447  21.960993
1        female  12101.6876  51.938573
         male     4449.5418  40.821484

In [5]:
def sur_percentage(survived_series):
    return (survived_series.sum()/survived_series.count())*100

titanic_df.groupby('Sex')['Survived'].agg(sur_percentage)

Sex
female    74.203822
male      18.890815
Name: Survived, dtype: float64

In [17]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,status
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,adult
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,child
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,child
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,adult
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,adult

In [9]:
titanic_df['status'] = 'dk'
for i in range(titanic_df.shape[0]):
    if titanic_df.loc[i,"Age"]>20:
        titanic_df.loc[i,'status'] = 'adult'
    else:
        titanic_df.loc[i,'status'] ='child'

In [13]:
def status(some_age):
    if some_age>20:
        return 'adult'
    else:
        return 'child'

In [14]:
titanic_df['status'] = titanic_df['Age'].apply(status)

In [16]:
titanic_df['status'] = titanic_df['Age'].apply(lambda x: 'adult' if x >20 else 'child')

In [18]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,status
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,adult
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,child
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,child
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,adult
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,adult

In [27]:
titanic_df.sort_values(['Survived','Sex','Fare'], ascending=[False, True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,status
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,adult
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,adult
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S,adult
311,312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,child
742,743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0000,NaN,S,child
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S,child
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,adult
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S,child
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S,adult

In [28]:
titanic_df.pivot_table(index='Pclass', columns='Sex', values='Fare', aggfunc='sum')

Sex        female       male
Pclass
1       9975.8250  8201.5875
2       1669.7292  2132.1125
3       2321.1086  4393.5865

In [3]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
titanic_df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [18]:
titanic_df['Embarked'].isnull()

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [34]:
import numpy as np
#titanic_df[titanic_df['Embarked']!=np.NaN]
titanic_df = titanic_df.dropna(subset=['Embarked'])

In [35]:
titanic_df = titanic_df.drop(columns='Cabin')

In [25]:
titanic_df['Age'].fillna(0)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 889, dtype: float64

In [36]:
titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)

In [28]:
titanic_df['Age'].fillna(method ='bfill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    26.0
889    26.0
890    32.0
Name: Age, Length: 889, dtype: float64

In [38]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [48]:
some_date ='2020-10-20'
from datetime import datetime
from datetime import timedelta

In [49]:
some_date = datetime.strptime(some_date, '%Y-%m-%d')

In [50]:
type(some_date)

datetime.datetime

In [44]:
some_date.year

2020

In [45]:
some_date = datetime.strftime(some_date, '%d-%m-%y')

In [46]:
type(some_date)

str

In [47]:
some_date

'20-10-20'

In [51]:
some_date+timedelta(days = 100 )

datetime.datetime(2021, 1, 28, 0, 0)

In [52]:
some_date - timedelta(hours=100)

datetime.datetime(2020, 10, 15, 20, 0)

In [54]:
some_other_date = datetime.strptime('2021-10-01', '%Y-%m-%d')

In [55]:
some_other_date - some_date

datetime.timedelta(days=346)

In [69]:
titanic_df[60:70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Dob
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.000000,0,0,2669,7.2292,C,None
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.000000,1,0,36973,83.4750,S,None
63,64,0,3,"Skoog, Master. Harald",male,4.000000,3,2,347088,27.9000,S,None
64,65,0,1,"Stewart, Mr. Albert A",male,29.642093,0,0,PC 17605,27.7208,C,None
65,66,1,3,"Moubarek, Master. Gerios",male,29.642093,1,1,2661,15.2458,C,None
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.000000,0,0,C.A. 29395,10.5000,S,None
67,68,0,3,"Crease, Mr. Ernest James",male,19.000000,0,0,S.P. 3464,8.1583,S,None
68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.000000,4,2,3101281,7.9250,S,None
69,70,0,3,"Kink, Mr. Vincenz",male,26.000000,2,0,315151,8.6625,S,None
70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.000000,0,0,C.A. 33111,10.5000,S,None

In [72]:
titanic_df = titanic_df.reset_index()

In [73]:
titanic_df[60:70]

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Dob
60,60,61,0,3,"Sirayanian, Mr. Orsen",male,22.000000,0,0,2669,7.2292,C,None
61,62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.000000,1,0,36973,83.4750,S,None
62,63,64,0,3,"Skoog, Master. Harald",male,4.000000,3,2,347088,27.9000,S,None
63,64,65,0,1,"Stewart, Mr. Albert A",male,29.642093,0,0,PC 17605,27.7208,C,None
64,65,66,1,3,"Moubarek, Master. Gerios",male,29.642093,1,1,2661,15.2458,C,None
65,66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.000000,0,0,C.A. 29395,10.5000,S,None
66,67,68,0,3,"Crease, Mr. Ernest James",male,19.000000,0,0,S.P. 3464,8.1583,S,None
67,68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.000000,4,2,3101281,7.9250,S,None
68,69,70,0,3,"Kink, Mr. Vincenz",male,26.000000,2,0,315151,8.6625,S,None
69,70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.000000,0,0,C.A. 33111,10.5000,S,None

In [57]:
datetime.today() - time

datetime.datetime(2024, 7, 8, 11, 29, 35, 344310)

In [59]:
titanic_df.shape[0]

889

In [63]:
titanic_df.loc[60,:]

PassengerId                            61
Survived                                0
Pclass                                  3
Name                Sirayanian, Mr. Orsen
Sex                                  male
Age                                  22.0
SibSp                                   0
Parch                                   0
Ticket                               2669
Fare                               7.2292
Embarked                                C
Dob            2002-07-14 11:32:54.908378
Name: 60, dtype: object

In [74]:
titanic_df['Dob'] = None
for i in range(titanic_df.shape[0]):

    titanic_df.loc[i,'Dob'] =  datetime.today() - timedelta(days = titanic_df.loc[i, 'Age']*365)

In [81]:
titanic_df[['Dob', 'Age']]

            Dob        Age
0    14-07-2002  22.000000
1    18-07-1986  38.000000
2    15-07-1998  26.000000
3    17-07-1989  35.000000
4    17-07-1989  35.000000
..          ...        ...
884  15-07-1997  27.000000
885  13-07-2005  19.000000
886  24-11-1994  29.642093
887  15-07-1998  26.000000
888  16-07-1992  32.000000

[889 rows x 2 columns]

In [80]:

for i in range(titanic_df.shape[0]):

    titanic_df.loc[i,'Dob'] = datetime.strftime(titanic_df.loc[i, 'Dob'],'%d-%m-%Y')

In [82]:
type(titanic_df.loc[60,'Dob'])

str

In [ ]:
titanic_df['Dob'] = titanic_df['Age'].